---
kind: other
id: Methods.T:Autodesk.Revit.DB.DimensionSegmentArrayIterator
source: html/ecfc3926-a69b-7703-5d3c-36b4e84f46f0.htm
---
# DimensionSegmentArrayIterator Methods

Causes the object to release immediately any resources it may be utilizing.